package ch06.sec3;

// public(공개) 외부에서 마음것 사용 할수 있는 class.
// 하나의 파일에 public(공개) class는 하나만 있어야 한다. 
public class SportsCar {
	// 1.일반적은 소스파일 하나의 하나의 클래스 작성
	// 2.두개 이상 class를 작성하는 경우는 두개 클래스가 매우 인접할때 같이 작성한다.
	// 3.테스트 틀래스를 만들어 빠른 결과 확인을 위해 작성하는 경우도 있다.
	
	// 라이브러리 클래스 : 실행은 되지 않고 다른 클래스에서 사용한다.
	// 실행 클래스 :  main() 클래스를 가지고 있는 실행 가능한 클래스.
	
	// class 블록에 선언되는 변수는 필드라고 부른다.
	// 메소드 블록 안에서 선언되는 것은 변수라고 한다.
}

class Tire{
	// 하나의 파일에 class가 하나 이상이면 각각의 바이트 코드 파일이 생성된다.
	// 하나의 파일에 여러개가 있으면 그냥 여러개라는뜻.
	
}

